{
  "frame_data_terms": {
    "frame": {
      "term": "Frame",
      "definition": "The base unit of time measurement in the game, equal to 1/60th of a second. All move properties are measured in frames."
    },
    "startup": {
      "term": "Startup Frames",
      "definition": "The number of frames from the input of an attack until the first active frame. The move cannot hit during this phase."
    },
    "active": {
      "term": "Active Frames",
      "definition": "The number of frames during which an attack's hitbox is present and can connect with an opponent."
    },
    "recovery": {
      "term": "Recovery Frames",
      "definition": "The number of frames after the last active frame, during which the character is returning to a neutral state and is unable to act."
    }
    "frame_advantage": {
      "term": "Frame Advantage",
      "definition": "The time difference, measured in frames, that determines which character can act first after an attack connects or is blocked."
    },
    "on_block": {
      "term": "On-Block Advantage",
      "definition": "The frame advantage after an attack is blocked. A positive value means the attacker can act first; a negative value means the defender can act first."
    },
    "on_hit": {
      "term": "On-Hit Advantage",
      "definition": "The frame advantage after an attack hits. A positive value allows the attacker to link into another attack, creating a combo."
    },
    "plus_frames": {
      "term": "Plus",
      "symbol": "+",
      "definition": "A state of positive frame advantage where the attacker recovers before the defender and can continue their turn."
    },
    "minus_frames": {
      "term": "Minus",
      "symbol": "-",
      "definition": "A state of negative frame advantage where the defender recovers before the attacker and can take their turn."
    },
    "safe_on_block": {
      "term": "Safe",
      "definition": "An attack that, when blocked, recovers quickly enough that the opponent cannot land a guaranteed punish."
    },
    "unsafe_on_block": {
      "term": "Unsafe / Punishable",
      "definition": "An attack that, when blocked, has enough recovery frames for the opponent to land a guaranteed counter-attack (a 'punish')."
    }
  },
  "hitbox_terms": {
    "hitbox": {
      "term": "Hitbox",
      "definition": "The invisible area of an attack that can deal damage. Typically represented by a red box.",
      "color_code": "Red"
    },
    "hurtbox": {
      "term": "Hurtbox",
      "definition": "The invisible area that defines where a character can be hit. Typically represented by a green box.",
      "color_code": "Green"
    },
    "counter_hit_hurtbox": {
      "term": "Counter Hit Hurtbox",
      "definition": "A hurtbox, typically present during a move's startup or active frames, that will trigger a Counter Hit if struck. Typically represented by a cyan box.",
      "color_code": "Cyan"
    },
    "disjoint": {
      "term": "Disjoint",
      "definition": "A highly advantageous property where a move's hitbox extends significantly beyond the character's own hurtbox, allowing it to hit from a range where it cannot be hit back."
    },
    "invincibility": {
      "term": "Invincibility (Invuln)",
      "definition": "A state where a character's hurtbox is temporarily removed, making them immune to being hit. Can be full or attribute-specific.",
      "types":
    },
    "low_profile": {
      "term": "Low Profile",
      "definition": "A property where a move's animation lowers the character's hurtbox enough to go under high-hitting attacks, causing them to whiff."
    },
    "armor": {
      "term": "Armor",
      "definition": "A property that allows a character to absorb one or more hits without being interrupted or put into hitstun. The character still takes damage."
    }
}
